In [3]:
import pandas as pd

df =pd.read_csv("Car_sales.csv")
df.head()

,Manufacturer,Model,Sales in thousands,4-year resale value,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch
0,Acura,Integra,16.919,16.36,Passenger,21.5,1.8,140,101.2,67.3,172.4,2.639,13.2,28,2-Feb-14
1,Acura,TL,39.384,19.875,Passenger,28.4,3.2,225,108.1,70.3,192.9,3.517,17.2,25,6-Mar-15
2,Acura,CL,14.114,18.225,Passenger,.,3.2,225,106.9,70.6,192,3.47,17.2,26,1-Apr-14
3,Acura,RL,8.588,29.725,Passenger,42,3.5,210,114.6,71.4,196.6,3.85,18,22,3-Oct-15
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150,102.6,68.2,178,2.998,16.4,27,10-Aug-15

In [4]:
# Print dataframe info_data types of each column 
df.dtypes

Manufacturer            object
Model                   object
Sales in thousands     float64
4-year resale value     object
Vehicle type            object
Price in thousands      object
Engine size             object
Horsepower              object
Wheelbase               object
Width                   object
Length                  object
Curb weight             object
Fuel capacity           object
Fuel efficiency         object
Latest Launch           object
dtype: object

In [5]:
# Print number of rows and columns
size = df.shape
print("rows: ",size[0])
print("cols: ",size[1])

rows:  157
cols:  15

In [8]:
# Drop duplicate rows_if any
df = df.drop_duplicates()

In [9]:
# Print number of rows and columns after dropping duplicates
df.shape

(157, 15)

In [11]:
# 6. Print summary statistics for numerical variables 
df.describe()

       Sales in thousands
count          157.000000
mean            52.998076
std             68.029422
min              0.110000
25%             14.114000
50%             29.450000
75%             67.956000
max            540.561000

In [14]:
# 7 Print number of missing values in each column 
df.isna().sum()

Manufacturer           0
Model                  0
Sales in thousands     0
4-year resale value    0
Vehicle type           0
Price in thousands     0
Engine size            0
Horsepower             0
Wheelbase              0
Width                  0
Length                 0
Curb weight            0
Fuel capacity          0
Fuel efficiency        0
Latest Launch          0
dtype: int64

In [20]:
# Count null values row-wise
null_counts_per_row = df.isnull().sum(axis=1)

# Display the first few rows
print(null_counts_per_row)

0      0
1      0
2      0
3      0
4      0
      ..
152    0
153    0
154    0
155    0
156    0
Length: 157, dtype: int64

In [22]:
# Drop the column with most missing values 
df.isna().sum().idxmax()

'Manufacturer'

In [31]:
# 9. Drop the rows with categorical missing values

# Identify categorical columns
categorical_columns = df.select_dtypes(include=['object', 'category']).columns

# Drop rows with missing values in categorical columns
df_cleaned = df.dropna(subset=categorical_columns)

# Display the first few rows after dropping
df_cleaned.head()

,Manufacturer,Model,Sales in thousands,4-year resale value,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch
0,Acura,Integra,16.919,16.36,Passenger,21.5,1.8,140,101.2,67.3,172.4,2.639,13.2,28,2-Feb-14
1,Acura,TL,39.384,19.875,Passenger,28.4,3.2,225,108.1,70.3,192.9,3.517,17.2,25,6-Mar-15
2,Acura,CL,14.114,18.225,Passenger,.,3.2,225,106.9,70.6,192,3.47,17.2,26,1-Apr-14
3,Acura,RL,8.588,29.725,Passenger,42,3.5,210,114.6,71.4,196.6,3.85,18,22,3-Oct-15
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150,102.6,68.2,178,2.998,16.4,27,10-Aug-15